testAme/labs/lab56/combustor2D-RPF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

deltaT		1e-5;

stopAt          endTime;

endTime         0.5;

adjustTimeStep	yes;

maxCo		5;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	#includeFunc	residuals(p,U,k,epsilon,h)
	#include	"functionObjects/fieldAverage.cpp"
	#include 	"functionObjects/forces.cpp"
	#include	"functionObjects/machNumber.cpp"
	#include	"functionObjects/pressure.cpp"
	#include	"functionObjects/temperature.cpp"
	#include	"functionObjects/yPlus.cpp"
}

